# Week 2 - Data Wrangling

## <span style="color:#1A9FFF">Workshop Outline</span>

* ** 1. Data Basics **
    + Tut 1a: Viewing Data
    + Tut 1b: Data Indexing and Selection
    + Exercise 1
    + 10 minutes break


* ** 2. Missing Data ** 
    + Tut 2a: Handling Missing Data
    + Tut 2b: Operations - universal functions (ufuncs)
    + Exercise 2
    + 10 minutes break
      

* ** 3. Merging and Grouping **
    + Tut 3a: Data Merging
    + Tut 3b: Data Grouping
    + Exercise 3
    + 10 minutes break

# <span style="color:#1A9FFF">1. Data Basics </span>
###  Import Libraries

In [1]:
import numpy as np
import pandas as pd

## <span style="color:#1A9FFF">Tut 1a. Viewing Data</span>

### Import Dataset

In [2]:
# Read Data from csv file named 'Titanic.csv'
# create a Pandas.Dataframe
titanic = pd.read_csv('Titanic.csv')

# Print out the shape of the titanic
# To make sure successful import
titanic.shape

(1312, 5)

### Check Top&Bottom Rows of DataFrames

<ul>
    <li>`head()` : return first n rows of a DataFrames</li>
    <li>`tail()` : return last n rows of a DataFrames</li>
</ul>

In [3]:
# Examine the top rows of data (default n = 5)
titanic.head()
# Select top n rows of data, we need to explicitly pass n to head() function
# titanic.head(6)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [4]:
# Examine the bottom rows of data (default n = 5)
titanic.tail()
# Select top n rows of data, we need to explicitly pass n to head() function
# titanic.tail(6)

                        Name PClass   Age   Sex  Survived
1307      Zakarian, Mr Artun    3rd  27.0  male         0
1308  Zakarian, Mr Maprieder    3rd  26.0  male         0
1309        Zenni, Mr Philip    3rd  22.0  male         0
1310        Lievens, Mr Rene    3rd  24.0  male         0
1311          Zimmerman, Leo    3rd  29.0  male         0

### Attributes of DataFrames
Pandas DataFrames are composed of Index, columns and underlying numpy data
<ul>
    <li>`index`   : the name of each row</li>
    <li>`columns` : the name of each column</li>
    <li>`value`   : all the content except index and columns in the DataFrame</li>
    <li>`sorting()`: sort data with certain conditions </li>
</ul>

##### Index, Columns, Values

In [5]:
titanic_head5 = titanic.head()

# get index attribute
titanic_head5.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# get column attribute
titanic_head5.columns

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived'], dtype='object')

In [7]:
# get values attribute
titanic_head5.values

array([['Allen, Miss Elisabeth Walton', '1st', 29.0, 'female', 1],
       ['Allison, Miss Helen Loraine', '1st', 2.0, 'female', 0],
       ['Allison, Mr Hudson Joshua Creighton', '1st', 30.0, 'male', 0],
       ['Allison, Mrs Hudson JC (Bessie Waldo Daniels)', '1st', 25.0,
        'female', 0],
       ['Allison, Master Hudson Trevor', '1st', 0.92, 'male', 1]],
      dtype=object)

##### Sorting

In [8]:
# Simple Sorting of data according to a column name, say 'Age', in ascending order
titanic_head5.sort_values(by='Age', ascending=True)

,Name,PClass,Age,Sex,Survived
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0

#### Note :

NaN, or 'Not a Number', is a special floating point value in Python indicates a missing data point.
In this case, the age of that particular person is not available.

We will go through common ways to handle NaN soon.

## <span style="color:#1A9FFF">Tut 1b. Data Indexing and Selection</span>

There are commonly three ways of data selection:
<ul>
    <li>Selection by Label</li>
    <li>Selection by Position</li>
    <li>Selection by Boolean Mask (Filtering)</li>
</ul>

.loc[] attribute is the primary indexing method of DataFrames

In [9]:
titanic_head7 = titanic.head(7).copy() # why copy?

### Getting
return values of certain elements from a DataFrame

##### Selection by label
A simple DataFrame (such as Titanic) can be interpreted as a 2D Matrix, where data can be indexed through labels of the two dimensions.

In [10]:
# By a single label.
# Note that '2' is interpreted as a label of the index, 
# not necessarily the integer position along the index
titanic_head7.loc[2]

Name        Allison, Mr Hudson Joshua Creighton
PClass                                      1st
Age                                          30
Sex                                        male
Survived                                      0
Name: 2, dtype: object

In [11]:
# By a list or array of labels
titanic_head7.loc[[4, 1, 1, 2]]

                                  Name PClass    Age     Sex  Survived
4        Allison, Master Hudson Trevor    1st   0.92    male         1
1          Allison, Miss Helen Loraine    1st   2.00  female         0
1          Allison, Miss Helen Loraine    1st   2.00  female         0
2  Allison, Mr Hudson Joshua Creighton    1st  30.00    male         0

In [12]:
# By a slice object with labels, 
# Note that both the start (3) and the stop (5) are included
titanic_head7.loc[3:5]

,Name,PClass,Age,Sex,Survived
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
5,"Anderson, Mr Harry",1st,47.00,male,1

In [13]:
# Selecting particular value given two labels as [index, column]
# Note 3:5 slices through the index (rows) and ['Age', 'Survived'] select columns.
titanic_head7.loc[3:5, ['Age', 'Survived']]

     Age  Survived
3  25.00         0
4   0.92         1
5  47.00         1

In [14]:
# An alternative to the above command #
titanic_head7.loc[3:5][['Age', 'Survived']]

     Age  Survived
3  25.00         0
4   0.92         1
5  47.00         1

##### Selection by position

`.iloc[]` is the primary attribute for selection by absolute position along index and columns.
Here 'i' in 'iloc' means 'implicit' indexing

In [15]:
# By a integer position
titanic_head7.iloc[4]

Name        Allison, Master Hudson Trevor
PClass                                1st
Age                                  0.92
Sex                                  male
Survived                                1
Name: 4, dtype: object

In [16]:
# By integer slices
# Note that in this case, only the start (2 and 0) is included as compared to .loc[]
titanic_head7.iloc[2:5, 0:3]

                                            Name PClass    Age
2            Allison, Mr Hudson Joshua Creighton    1st  30.00
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.00
4                  Allison, Master Hudson Trevor    1st   0.92

In [17]:
# By List of integer positions
titanic_head7.iloc[[3, 1, 5], [2, 4]]

    Age  Survived
3  25.0         0
1   2.0         0
5  47.0         1

##### Selection by Boolean Mask

Boolean masking is very helpful and flexible in specifying condition during data selection.
Note that direct masking operations are interprected row-wise rather than column-wise

In [18]:
# by value conditions
# Suppose we wish to choose those ages under 30 years old, male passengers
titanic_head7[  (titanic_head7['Age'] <= 30) & (titanic_head7['Sex'] == 'male') ]


# The condition statement returns a bool mask that select the required elements
# (titanic_head7['Age'] <= 30)
# (titanic_head7['Sex'] == 'male')

                                  Name PClass    Age   Sex  Survived
2  Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0
4        Allison, Master Hudson Trevor    1st   0.92  male         1

### Setting
assign values to certain elements of a DataFrame, getting elements by any selection function `(.loc[], .iloc[])`

`( geting elements ) = values`

##### add new row

In [37]:
# create a new item
new_item = ['Emma Stone', '1st', 28, 'female', 1]

# add the new item to DataFrame
titanic_head7.loc[7,:] = new_item  # titanic_head7.iloc[7,:] = new_item (wrong)
titanic_head7

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1.0
1,"Allison, Miss Helen Loraine",1st,2.00,female,0.0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0.0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0.0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1.0
5,"Anderson, Mr Harry",1st,47.00,male,1.0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1.0
7,Emma Stone,1st,28.00,female,1.0

`.iloc[]` can be used in setting when the related items exist

##### add new column

In [41]:
# create a new attribute height
height = np.array([166] * len(titanic_head7))

# add the new attribute Height with height to DataFrame
titanic_head7.loc[:,'Height'] = height # titanic_head7.iloc[:,4] = height (wrong)
titanic_head7

,Name,PClass,Age,Sex,Survived,Height
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1.0,166
1,"Allison, Miss Helen Loraine",1st,2.00,female,0.0,166
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0.0,166
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0.0,166
4,"Allison, Master Hudson Trevor",1st,0.92,male,1.0,166
5,"Anderson, Mr Harry",1st,47.00,male,1.0,166
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1.0,166
7,Emma Stone,1st,28.00,female,1.0,166

##### replace values in DataFrame

In [42]:
# create values for replacing
new_age = np.array([22] * len(titanic_head7))

# replace values in DataFrame
titanic_head7.loc[:,'Age'] = new_age # titanic_head7.iloc[:,2] = new_age 
titanic_head7

,Name,PClass,Age,Sex,Survived,Height
0,"Allen, Miss Elisabeth Walton",1st,22,female,1.0,166
1,"Allison, Miss Helen Loraine",1st,22,female,0.0,166
2,"Allison, Mr Hudson Joshua Creighton",1st,22,male,0.0,166
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,22,female,0.0,166
4,"Allison, Master Hudson Trevor",1st,22,male,1.0,166
5,"Anderson, Mr Harry",1st,22,male,1.0,166
6,"Andrews, Miss Kornelia Theodosia",1st,22,female,1.0,166
7,Emma Stone,1st,22,female,1.0,166

## <span style="color:#FF8B33">Exercise 1 (10 mins break)</span> 
Open `Week2 - Exercise 1.ipynb` and complete the exercises.

# <span style="color:#1A9FFF">2. Missing Data</span>
## <span style="color:#1A9FFF">Tut 2a. Handling Missing Data</span>

### What is NaN ?

The difference between data found in many tutorials and data in the real world is that real-world data is rarely clean and homogeneous. In particular, many interesting datasets will have some amount of data missing.

Pandas chose to use two already-existing Python null values for missing data:
<ul>
    <li>the special floating-point <b>NaN</b> value</li>
    <li>the Python <b>None</b> object</li>
</ul>

`NaN` usually appears in numerical datasets and `None` appears in the rest of cases.

`NaN` and `None` both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate.

In [44]:
# Let's create a simple Pandas Series example. Data in Series share the same type
s_nan = pd.Series([1, np.nan, 2, None])
s_nan

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

Note that in the above example, `np.nan` is of dtype float64, thus, 1 and 2 are both upcasted to float64 from integer type. 

The `None` (dtype: Object) appears in a numerical array, and automatically downcast to float64 as well.

### Operating on Null Values

Pandas provide several useful methods for detecting, removing, and replacing null values in Pandas data structures. They are:
<ul>
    <li>`isnull()`: Generate a boolean mask indicating missing values</li>
    <li>`notnull()`: Opposite of `isnull()`</li>
    <li>`dropna()`: Return a filtered version of the data</li>
    <li>`fillna()`: Return a copy of the data with missing values filled or imputed</li>
</ul>

##### Detecting null values

In [45]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [52]:
# The returned boolean array can be used for data masking
data[data.notnull()]

0        1
2    hello
dtype: object

Note that since 'hello' is string, which is of dtype: `object`, the interger '1' is upcast to dtype `object`.

##### Dropping null values

In [53]:
# Drop null values in Series
data.dropna()

0        1
2    hello
dtype: object

In [55]:
# Drop null values in DataFrames
data2 = pd.DataFrame([[1,      np.nan, 2],
                      [2,      3,      5],
                      [np.nan, 4,      6]])
data2.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

We can't drop single value in DataFrames; We can only drop full rows or full columns.

By default, `dropna()` will drop all rows in which any null value is present, but we can choose to drop columns instead by specifying the 'axis' param

In [56]:
data2.dropna()

     0    1  2
1  2.0  3.0  5

In [57]:
data2.dropna(axis='columns')

   2
0  2
1  5
2  6

There are other commonly used params for finer-grained control, such as:
<ul>
    <li>`how=any, all` : rows or columns with ( any, all ) elements set to null value will be droped</li>
    <li>`thresh=#` : # represents the minimum number of non-null values for the row/column to be kept</li>
</ul>

##### Filling null values

In [58]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [59]:
# We can fill NA entries with a single value, such as zero:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [60]:
# We can also specify a forward-fill to propagate the previous value forward
# or a backward-fill to propagate the next value backward
# the default direction is along row (axis = 0) 
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [61]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [62]:
# In DataFrames, we can also specify an 'axis' along which the fills take place
data2

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [63]:
# Let's try forward-fill along column direction
data2.fillna(method='ffill', axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

Notice that if the previous value is not available during a forward fill, the NA value remains.

## <span style="color:#1A9FFF">Tut 2b. Operations - universal functions (ufuncs)</span>

The Universal Functions (or ufuncs) inherited from numpy are keys to numerical operations in Pandas in performing **element-wise operations**, both with basic arithmetic (+, -, *, etc.) and with more sophisticated operations (sin(), exp(), log() etc.)

Pandas includes a couple useful twists, however: for unary operations like negation and trigonometric functions, these ufuncs will preserve index and column labels in the output, and for binary operations such as addition and multiplication, Pandas will automatically align indices when passing the objects to the ufunc. This means that keeping the context of data and combining data from different sources–both potentially error-prone tasks with raw NumPy arrays–become essentially foolproof ones with Pandas.

### Index Preservation during Operation

In [68]:
# Let's prepare some data
np.random.seed(0)
ser = pd.Series(np.random.randint(0, 10, 4,))
ser

0    5
1    0
2    3
3    3
dtype: int32

In [75]:
np.random.seed(0)
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  5  0  3  3
1  7  9  3  5
2  2  4  7  6

In [71]:
# numpy unary operations can be applied directly
# E.g. exponential function
np.exp(ser)

0    148.413159
1      1.000000
2     20.085537
3     20.085537
dtype: float64

In [76]:
# Similarly on Dataframes
np.sin(df * np.pi / 4)

          A             B         C         D
0 -0.707107  0.000000e+00  0.707107  0.707107
1 -0.707107  7.071068e-01  0.707107 -0.707107
2  1.000000  1.224647e-16 -0.707107 -1.000000

Note that all the columns and index are preserved

### Index alignment during operation

In [77]:
# Sample Data
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 
                        'New York': 19651127}, name='population')

area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [78]:
# Let's estimate the population density
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

The resulting array contains the union of indices of the two input arrays. The indices are aligned before binary operations and NaN is used for missing data.

In [83]:
# How about DataFrames
np.random.seed(0)
df1 = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
df1

    A   B
0  12  15
1   0   3

In [85]:
np.random.seed(0)
df2 = pd.DataFrame(np.random.randint(0, 10, (3, 3)), columns=list('BAC'))
df2

   B  A  C
0  5  0  3
1  3  7  9
2  3  5  2

In [86]:
df1 + df2

      A     B   C
0  12.0  20.0 NaN
1   7.0   6.0 NaN
2   NaN   NaN NaN

Notice that the indices are aligned correctly and indices in the result are sorted.

In [88]:
print ('df1 : \n', df1,  '\n')
print ('df2 : \n', df2,  '\n')

df1.add(df2, fill_value=8)

df1 :
     A   B
0  12  15
1   0   3

df2 :
    B  A  C
0  5  0  3
1  3  7  9
2  3  5  2

      A     B     C
0  12.0  20.0  11.0
1   7.0   6.0  17.0
2  13.0  11.0  10.0

Above uses the Pandas object (df1 is a DataFrame object) method.

The following table lists Python operators and their equivalent Pandas object methods:


| Python Operator | Pandas Method | 
| :-------------: |:------------- |
| +               | `add()`       |
| -               | `sub()`, `subtract()`            |
| *               | `mul()`, `multiply()`            |
| /               | `truediv()`, `div()`, `divide()` |
| //              | `floordiv()`  |
| %               | `mod()`       |
| **              | `pow()`       |

#### Broadcasting Operation

Operations between DataFrame and a Series follows the broadcasting rules as in numpy.

In [90]:
df2

   B  A  C
0  5  0  3
1  3  7  9
2  3  5  2

In [94]:
df2.iloc[1]

B    3
A    7
C    9
Name: 1, dtype: int32

In [97]:
df2.sub(df2.iloc[1], axis='columns')

   B  A  C
0  2 -7 -6
1  0  0  0
2  0 -2 -7

In [99]:
df2.sub(df2['B'], axis='index')

   B  A  C
0  0 -5 -2
1  0  4  6
2  0  2 -1

Note that these DataFrame/Series operations, like operations discussed above, will automatically align indices between two elements.

## <span style="color:#FF8B33">Exercise 2 (10 mins break)</span> 
Open `Week2 - Exercise 2.ipynb` and complete the exercises.

# <span style="color:#1A9FFF">3. Merging and Grouping</span>
## <span style="color:#1A9FFF">Tut 3a. Data Merging</span>

Sometimes we need to combine data from different data sources. These operations can involve anything from straightforward concatenation of two different datasets, to more complicated database-style joins and merges that correctly handle any overlaps between the datasets.

In [48]:
# Let's define some utilities which helps in the following session

# Define a function which creates a DataFrame of a particular form
def make_df(columns, indices):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in indices]
            for c in columns}
    return pd.DataFrame(data, indices)

# Define a class that allows us to display multiple DataFrame side by side
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

#### Simple Concatenation with pd.concat

In [49]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
df_concat = pd.concat([df1, df2])
display('df1', 'df2', 'df_concat')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

df_concat
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [50]:
# We can specify the axis along which concatenation occurs
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis=1)")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

#### Duplicate Indices

Different from numpy np.concatenate method, Pandas pd.concat preserves indices, even if the result will have duplicate indices

In [51]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # make duplicate indices!
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

Pandas Defines various params in `pd.concat` to handle such situation:

<ul>
    <li>verify_integrity:&nbsp;&nbsp;&nbsp; raises error msg when dupliate indices happen</li>
    <li>ignore_index:&nbsp;&nbsp;&nbsp; the original indices will be ignored and new indices will be created</li>
    <li>keys:&nbsp;&nbsp;&nbsp; used to specify a label for the data sources. The result will be a hierarchically indexed series containing the data </li>
</ul>

For more information, please check out the Hierarchical Indexing and `pd.concat` documentation.

In [52]:
# How about concatenating DataFrames with different set operation
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6])', 
        "pd.concat([df5, df6], join='inner')", 
        "pd.concat([df5, df6], join='outer')", 
        "pd.concat([df5, df6], join_axes=[df5.columns])")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

pd.concat([df5, df6], join='outer')
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

pd.concat([df5, df6], join_axes=[df5.columns])
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

Notice that the `join` param defines either intersection or union of the different columns sets.
By Default, `join=outer`

The `join_axes` param defines what the column set of result DataFrame would be.

Feel free to check out <b>Append, Merge</b>, which works similarly as concatenation

## <span style="color:#1A9FFF">Tut 3b. Data Grouping</span>

### `describe()` provides a brief summary of a DataFrame

In [53]:
titanic_small = titanic.head(20)
titanic_small.dropna().describe()

             Age   Survived
count  17.000000  17.000000
mean   36.760000   0.529412
std    19.401655   0.514496
min     0.920000   0.000000
25%    25.000000   0.000000
50%    37.000000   1.000000
75%    47.000000   1.000000
max    71.000000   1.000000

#### Quick Review:

The common aggregation methods that Pandas provided are listed below:

| Aggregation     | Description   |  
| :-------------: |:------------- |
| `count()`               | Total number of items       |
| `first()`, `last()`     | First and last item         |
| `mean()`, `median()`    | mean and median             |
| `min()`, `max()`        | Minimum and maximum         |
| `std()`, `var()`        | Standard deviation and variance  |
| `mad()`                 | Mean absolute deviation       |
| `prod()`                | Product of all items          |
| `sum()`                 | Sum of all items              |

Above are all object methods of DataFrame and Series objects

### GroupBy: Split, Apply, Combine

Simple aggregations can give you a flavor of your dataset, but often we would prefer to aggregate data conditionally: this is implemented in the so-called groupby operation. 

A canonical example of this split-apply-combine operation, where the "apply" is a summation aggregation, is illustrated below:

<img src="res/split-apply-combine.png">
This makes clear what the groupby accomplishes:
<ul>
<li>The split step involves breaking up and grouping a DataFrame depending on the value of the specified key. </li>
<li>The apply step involves computing some function, usually an aggregate, transformation, or filtering, within the individual groups. </li>
<li>The combine step merges the results of these operations into an output array.</li>
</ul>

In [54]:
titanic_small.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [55]:
# Let's see how to groupby in action
# Suppose we wish to examine the average survival rate of different PClass
# Step 1 Groupby 'PClass'
titanic_by_pclass = titanic.groupby('PClass')
titanic_by_pclass

Note that the operation returns a DataFrameGroupBy object.

In [56]:
# Step 2 Now the data are grouped, 
# Let's compute the mean along survival column to see average survival rate
titanic_by_pclass['Survived'].mean()

PClass
1st    0.599379
2nd    0.426523
3rd    0.194093
Name: Survived, dtype: float64

It's shown that over half of 1st class passengers (Hi Rose!) survived while less than 20% passengers in 3rd class survived (Sorry, Jack...).

In [57]:
# How about groupby 'Sex'
titanic.groupby('Sex')['Survived'].mean()

Sex
female    0.666667
male      0.167059
Name: Survived, dtype: float64

As expected

### Pivot_Tables

In the end, let's get a flavour of an advanced topic: Piovt_tables

Suppose we wish to look at the survival by both sex and PClass. With `GroupBy`, we might proceed using something like this:
<ul>
    <li> `GroupBy` class and gender</li>
    <li> Select `Survived` </li>
    <li> Apply a ***mean*** aggregate</li>
    <li> combine the resulting groups and unstack the hierarchical index to reveal the hidden multidimensionality</li>
</ul>

In [58]:
titanic.groupby(['Sex', 'PClass'])['Survived'].aggregate('mean').unstack()

PClass       1st       2nd       3rd
Sex
female  0.937063  0.878505  0.377358
male    0.329609  0.145349  0.116232

In [59]:
# This is how we proceed with pivot tables, the default aggregate function is mean
titanic.pivot_table('Survived', index='Sex', columns='PClass')

PClass       1st       2nd       3rd
Sex
female  0.937063  0.878505  0.377358
male    0.329609  0.145349  0.116232

In [60]:
# How about Age information
# first define age intervals using Pandas.cut function
age_cut = pd.cut(titanic['Age'], [0, 21, 80])
titanic.pivot_table('Survived', index=['Sex', age_cut], columns='PClass')

PClass                1st       2nd       3rd
Sex    Age
female (0, 21]   0.944444  0.960000  0.460000
       (21, 80]  0.951807  0.850000  0.442308
male   (0, 21]   0.700000  0.406250  0.191176
       (21, 80]  0.313043  0.084211  0.128378

There are a lot more that Pandas provide. 

Feel free to check out the Official Documentation
https://pandas.pydata.org/pandas-docs/stable/index.html

## <span style="color:#FF8B33">Exercise 3 (10 mins break)</span> 
Open `Week2 - Exercise 3.ipynb` and complete the exercises.